Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK2051SG01144.atdf
            <register-group name="FUSES_DALCFG" name-in-module="FUSES_DALCFG" address-space="base" offset="0x0A004000"/>
            <register-group name="FUSES_USERCFG1" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A000000"/>
            <register-group name="FUSES_USERCFG2" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A008000"/>
            <register-group name="FUSES_CALOTP" name-in-module="FUSES_CALOTP" address-space="base" offset="0x0A007000"/>
            <parameters>
              <param name="RDY_MSB" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x44010000"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA09" ioset="2"/>
              <signal group="IO" index="0" function="M" pad="PA03" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA01" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA10" ioset="2"/>
              <signal group="IO" index="2" function="M" pad="PA20" ioset="3"/>
              <signal group="IO" index="2" function="M" pad="PC00" ioset="1"/>
              <signal group="IO" index="2" function="M" pad="PD12" ioset="2"/>
              <signal group="IO" index="3" function="M" pad="PA21" ioset="3"/>
              <signal group="IO" index="3" function="M" pad="PC01" ioset="1"/>
              <signal group="IO" index="3" function="M" pad="PD05" ioset="2"/>
              <signal group="IO" index="4" function="M" pad="PA22" ioset="3"/>
              <signal group="IO" index="4" function="M" pad="PC02" ioset="1"/>
              <signal group="IO" index="4" function="M" pad="PD06" ioset="2"/>
              <signal group="IO" index="5" function="M" pad="PA23" ioset="3"/>
              <signal group="IO" index="5" function="M" pad="PC03" ioset="1"/>
              <signal group="IO" index="5" function="M" pad="PD07" ioset="2"/>
              <signal group="IO" index="6" function="M" pad="PA17" ioset="2"/>
              <signal group="IO" index="6" function="M" pad="PC04" ioset="1"/>
              <signal group="IO" index="7" function="M" pad="PA24" ioset="2"/>
              <signal group="IO" index="7" function="M" pad="PC05" ioset="1"/>
            </signals>
            <parameters>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="11" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="11" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="48" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="12" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="8" caption="Instance index for GCLK"/>
              <param name="MCLK_ID_APB" value="40" caption="Index for GCLK APB clock"/>
              <param name="PAC_ID" value="8" caption="Index for GCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIX2" address-space="base" offset="0x44806000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for HMATRIX"/>
              <param name="MCLK_ID_AHB" value="10" caption="Index for HMATRIX AHB clock"/>
              <param name="MCLK_ID_APB" value="67" caption="Index for HMATRIX APB clock"/>
              <param name="PAC_ID" value="35" caption="Index for HMATRIX registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HSM" id="03785" name2="sec_hsm_v1" version="1b0">
          <instance name="HSM">
            <register-group name="HSM" name-in-module="HSM" address-space="base" offset="0x48000000"/>
            <parameters>
              <param name="KEN_VALUE" value="0"/>
              <param name="g_ClkGating" value="1"/>
              <param name="INSTANCE_ID" value="98" caption="Instance index for HSM"/>
              <param name="MCLK_ID_AHB" value="22" caption="Index for HSM AHB clock"/>
              <param name="PAC_ID" value="98" caption="Index for HSM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
          <instance name="ICB_NS">
            <register-group name="ICB_NS" name-in-module="ICB" address-space="base" offset="0xE002E000"/>
          </instance>
        </module>
        <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x4480C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38" caption="Instance index for IDAU"/>
              <param name="MCLK_ID_APB" value="69" caption="Index for IDAU APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for IDAU registers write protection"/>
              <param name="GRANULARITY_ANSC" value="0x1000" caption="Application Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_ANS" value="0x1000" caption="Application Non-Secure region granularity"/>
              <param name="GRANULARITY_AS" value="0x1000" caption="Application Secure region granularity"/>
              <param name="GRANULARITY_RS" value="0x1000" caption="RAM Secure region granularity"/>
              <param name="GRANULARITY_RNS" value="0x1000" caption="RAM Non-Secure region granularity"/>
              <param name="GRANULARITY_BNSC" value="0x1000" caption="Boot Flash Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_BOOTPROT" value="0x1000" caption="BOOTPROT region granularity"/>
              <param name="GRANULARITY_BS" value="0x1000" caption="Boot Flash Secure region granularity"/>
              <param name="REGION_CMCCDS" value="0x01" caption="CMCC DATA RAM Secure region ID"/>
              <param name="REGION_CMCCTS" value="0x02" caption="CMCC TAG RAM Secure region ID"/>
              <param name="REGION_CMCCVS" value="0x03" caption="CMCC VALID RAM Secure region ID"/>
              <param name="REGION_BOOTROM" value="0x04" caption="Boot ROM region ID"/>
              <param name="REGION_BS" value="0x05" caption="Boot Flash Secure region ID"/>
              <param name="REGION_BNSC" value="0x06" caption="Boot Flash Non-Secure Callable region ID"/>
              <param name="REGION_CFMS" value="0x07" caption="CONFIGURATION Flash Secure region ID"/>
              <param name="REGION_AS" value="0x08" caption="Application Secure region ID"/>
              <param name="REGION_ANSC" value="0x09" caption="Application Non-Secure Callable region ID"/>
              <param name="REGION_ANS" value="0x0A" caption="Application Non-Secure region ID"/>
              <param name="REGION_RS" value="0x0D" caption="RAM Secure region ID"/>
              <param name="REGION_RNS" value="0x0E" caption="RAM Non-Secure region ID"/>
              <param name="REGION_HPB0" value="0x0F" caption="Peripheral Bus A region ID"/>
              <param name="REGION_HPB1" value="0x10" caption="Peripheral Bus B region ID"/>
              <param name="REGION_HPB2" value="0x11" caption="Peripheral Bus C region ID"/>
              <param name="REGION_USBHS" value="0x12" caption="USB SFR region ID"/>
              <param name="REGION_HSM" value="0x13" caption="HSM region ID"/>
              <param name="REGION_OTHER" value="0x00" caption="Other region ID"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
