Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK2051SG01144.atdf
          </instance>
          <instance name="SIG_NS">
            <register-group name="SIG_NS" name-in-module="SIG" address-space="base" offset="0xE002EF00"/>
          </instance>
        </module>
        <module name="SPI_IXS" id="03574" name2="spi_ixs_apb_v1" version="1a0">
          <instance name="SPI_IXS">
            <register-group name="SPI_IXS" name-in-module="SPI_IXS" address-space="base" offset="0x45016000"/>
            <signals>
              <signal group="FSYNC" function="J" pad="PA09" ioset="2"/>
              <signal group="FSYNC" function="J" pad="PD06" ioset="1"/>
              <signal group="FSYNC" function="J" pad="PD13" ioset="3"/>
              <signal group="SCK" function="J" pad="PA11" ioset="2"/>
              <signal group="SCK" function="J" pad="PD10" ioset="1"/>
              <signal group="SCK" function="J" pad="PD14" ioset="3"/>
              <signal group="SDI" function="J" pad="PA12" ioset="2"/>
              <signal group="SDI" function="J" pad="PD07" ioset="1"/>
              <signal group="SDI" function="J" pad="PD16" ioset="3"/>
              <signal group="SDO" function="J" pad="PB00" ioset="2"/>
              <signal group="SDO" function="J" pad="PD08" ioset="1"/>
              <signal group="SDO" function="J" pad="PD17" ioset="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="65"/>
              <param name="DMAC_ID_TX" value="66"/>
              <param name="GCLK_ID" value="36" caption="Index of Generic Clock"/>
              <param name="TPD_MASTER" value="0" caption="Indicates a master or slave number for TPD mode( 1=master,0=slave)"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for SPI_IXS"/>
              <param name="MCLK_ID_APB" value="107" caption="Index for SPI_IXS APB clock"/>
              <param name="PAC_ID" value="75" caption="Index for SPI_IXS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SQI" id="04044" name2="sqi_ctlr_v4" version="4b0">
          <instance name="SQI">
            <register-group name="SQI" name-in-module="SQI" address-space="base" offset="0x0FFFF000"/>
            <signals>
              <signal group="CLK" function="H" pad="PD10" ioset="1"/>
              <signal group="CS" index="0" function="H" pad="PD06" ioset="1"/>
              <signal group="CS" index="1" function="H" pad="PD05" ioset="1"/>
              <signal group="CS" index="2" function="H" pad="PA10" ioset="1"/>
              <signal group="CS" index="3" function="H" pad="PD12" ioset="1"/>
              <signal group="DATA" index="0" function="H" pad="PD07" ioset="1"/>
              <signal group="DATA" index="1" function="H" pad="PD11" ioset="1"/>
              <signal group="DATA" index="2" function="H" pad="PD08" ioset="1"/>
              <signal group="DATA" index="3" function="H" pad="PD09" ioset="1"/>
            </signals>
            <parameters>
              <param name="ATSPEED_IMPLEMENTED" value="1"/>
              <param name="CBUF_DEPTH" value="3"/>
              <param name="GCLK_ID" value="43" caption="Index of Generic Clock"/>
              <param name="SFR_ADDRESS" value="0x0ffff000"/>
              <param name="TRXBUF_DEPTH" value="8"/>
              <param name="XIP_ADDRESS" value="0x10"/>
              <param name="XIP_CS_MSB" value="3"/>
              <param name="XIP_HSEL" value="1"/>
              <param name="INSTANCE_ID" value="96" caption="Instance index for SQI"/>
              <param name="MCLK_ID_AHB" value="16" caption="Index for SQI AHB clock"/>
              <param name="PAC_ID" value="96" caption="Index for SQI registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1b0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x44008000"/>
            <signals>
              <signal group="ATEST_ANA" function="default" pad="ATEST_ANA"/>
              <signal group="EXT_VREF_ANA" function="default" pad="EXT_VREF_ANA"/>
            </signals>
            <parameters>
              <param name="ADDVREG_NUM" value="1" caption="Number of additional capless regulators for USB, PLL, ..."/>
              <param name="ADDVREG_PLL_NUM" value="0" caption="Number of additional capless regulators dedicated to PLL(s) (between 0 and ADDVREG_NUM)"/>
              <param name="ADDVREG_PLL_START_INDEX" value="1" caption="Index of the first additional capless regulator dedicated to a PLL within [ADDVREG_NUM-1:0] range. Must be equal to 1 if ADDVREG_PLL_NUM=0."/>
              <param name="BKOUT_NUM" value="2" caption="Number of BKOUT output pin"/>
              <param name="BORVDDUSB_NUM" value="1" caption="Number of BOR_USB"/>
              <param name="CHRG_PUMP_NUM" value="2" caption="Number of Charge Pump"/>
              <param name="IOB_IMPLEMENTED" value="1" caption="one if IOB feature is implemented"/>
              <param name="USER_LDO_IMPLEMENTED" value="1" caption="one if USER_LDO feature is implemented"/>
              <param name="VBAT_IMPLEMENTED" value="1" caption="one if VBAT feature (battery backup feature) is implemented."/>
              <param name="VREGSW_NUM" value="2" caption="Number of main voltage regulator (100mA). Example: 1 for Unicorn, 4 for Riverside."/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for SUPC"/>
              <param name="MCLK_ID_APB" value="36" caption="Index for SUPC APB clock"/>
              <param name="PAC_ID" value="4" caption="Index for SUPC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
