Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK2051SG01144.atdf
          </instance>
          <instance name="SysTick_NS">
            <register-group name="SysTick_NS" name-in-module="SysTick" address-space="base" offset="0xE002E010"/>
            <parameters>
              <param name="__SYST_NUM" value="2" caption="Number of implemented SysTick timers"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="4d0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x44818000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PB10" ioset="2"/>
              <signal group="WO" index="0" function="F" pad="PB04" ioset="1"/>
              <signal group="WO" index="1" function="G" pad="PC00" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PB05" ioset="1"/>
              <signal group="WO" index="2" function="G" pad="PC01" ioset="2"/>
              <signal group="WO" index="2" function="F" pad="PB13" ioset="1"/>
              <signal group="WO" index="3" function="G" pad="PC02" ioset="2"/>
              <signal group="WO" index="3" function="F" pad="PB06" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PC03" ioset="2"/>
              <signal group="WO" index="4" function="F" pad="PB14" ioset="1"/>
              <signal group="WO" index="5" function="G" pad="PC04" ioset="2"/>
              <signal group="WO" index="5" function="F" pad="PB15" ioset="1"/>
              <signal group="WO" index="6" function="G" pad="PC21" ioset="2"/>
              <signal group="WO" index="6" function="F" pad="PB21" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PC22" ioset="2"/>
              <signal group="WO" index="7" function="F" pad="PB22" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="14" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="15" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="16" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="17" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="18" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="19" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="13" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="44" caption="Instance index for TCC0"/>
              <param name="MCLK_ID_APB" value="75" caption="Index for TCC0 APB clock"/>
              <param name="PAC_ID" value="44" caption="Index for TCC0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x4481A000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PC05" ioset="2"/>
              <signal group="WO" index="0" function="F" pad="PC15" ioset="1"/>
              <signal group="WO" index="1" function="G" pad="PC06" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC16" ioset="1"/>
              <signal group="WO" index="2" function="G" pad="PC07" ioset="2"/>
              <signal group="WO" index="2" function="F" pad="PC17" ioset="1"/>
              <signal group="WO" index="3" function="G" pad="PC09" ioset="2"/>
              <signal group="WO" index="3" function="F" pad="PC18" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PC15" ioset="2"/>
              <signal group="WO" index="4" function="F" pad="PC19" ioset="1"/>
              <signal group="WO" index="5" function="G" pad="PC10" ioset="2"/>
              <signal group="WO" index="5" function="F" pad="PC20" ioset="1"/>
              <signal group="WO" index="6" function="G" pad="PC11" ioset="2"/>
              <signal group="WO" index="6" function="F" pad="PC28" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PC12" ioset="2"/>
              <signal group="WO" index="7" function="F" pad="PC29" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="21" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="22" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="23" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="24" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="25" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="26" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="20" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="45" caption="Instance index for TCC1"/>
              <param name="MCLK_ID_APB" value="76" caption="Index for TCC1 APB clock"/>
              <param name="PAC_ID" value="45" caption="Index for TCC1 registers write protection"/>
            </parameters>
          </instance>
